package ru.skypro;

public class Main {

    public static void main(String[] args) {
        // 5. Значение вернулось к тому значению которое было в методе потому что в памяти именно то значение что в методе
        // 6. Все тоже самое, значение вернулось обратно.
        // 7. Значение вернулось обратно, к исходному варианту
        // 8. Переменная изменилась так как я её поменял непосредственно в методе.
        // 9. Возвращает все обратно к исходным значениям из метода.
        // 10. все тоже самое изменить данные неполучилось, все возвращается к исходному варианту.
        //Прихожу к выводу, что что-бы поменять какие либо данные, нужно это делать непосредственно в методе.
//
    }
}
